# Base system packages
base
base-devel
linux
linux-firmware
linux-headers

# Boot and firmware
amd-ucode
efibootmgr
dkms

# File systems
btrfs-progs
lvm2
snapper
smartmontools
ddrescue
dosfstools
exfatprogs
ntfs-3g
xfsprogs

# Display server
xorg-xinit
xorg-xrandr
xterm

# Window manager and tools
i3-wm
i3blocks
i3lock
i3status
dmenu
rofi
polybar
picom
feh
unclutter
xss-lock

# Wayland compositor (Sway)
sway
swaybg
swayidle
swaylock
waybar
grim
slurp
xorg-xwayland
egl-wayland

# Display manager
lightdm
lightdm-gtk-greeter

# Audio
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
libpulse
gst-plugin-pipewire
wireplumber
pamixer

# Bluetooth
bluez
bluez-utils

# Network
iwd
wpa_supplicant
wireless_tools
openssh

# Terminals
ghostty
ghostty-shell-integration

# Editors
neovim
vim
nano

# Development tools
git
github-cli
lazygit
tree-sitter-cli
uv

# CLI utilities
htop
fzf
fd
ripgrep
wget
bat
tldr
man-db

# Graphics
nvidia-open-dkms
libva-nvidia-driver

# Fonts
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols-mono
otf-font-awesome
woff2-font-awesome
noto-fonts-emoji

# Security
ccid

# Screenshots
flameshot

# File manager
thunar
thunar-archive-plugin
thunar-volman
gvfs
udisks2
polkit-gnome

# Disk utilities
gparted

# Other
firefox
xdg-utils
sassc
zram-generator
steam
